<template>
  <div class="Questions">
    <Splicer>
      <span>Вопросы и ответы</span>
      <img
        class="Splicer__applyIcon"
        v-if="!isMobileSize"
        src="../assets/icons/decor_splicer.png"
        alt="decoration"
    /></Splicer>
    <ul class="Questions__list">
      <li tabindex="0">
        <span class="Questions__title"
          >Как принять участие в рекламной игре?
        </span>
        <p class="Questions__content">
          С 1 марта 2021 года по 30 апреля 2021 года включительно нужно:
          <br /><br />
          1) Купить 2 продукта, участвующих в рекламной игре, в любом магазине
          «ГИППО», «GREEN», или «ВИТАЛЮР» на территории Республики Беларусь и
          сохранить чек. <br /><br />
          2) Зарегистрироваться в рекламной игре на сайте: nestle-cereals.by.
          Для этого нужно заполнить специальную форму и загрузить чёткое
          изображение чека. <br /><br />
          3) После того, как Вы выполнили два первых пункта, в течение ближайших
          24 часов, Вы получите SMS с игровым кодом на номер, который указали
          при регистрации.
        </p>
      </li>
      <li tabindex="0">
        <span class="Questions__title">
          Где можно приобрести продукцию, участвующую в игре?
        </span>
        <p class="Questions__content">
          Продукцию, участвующую в рекламной игре, Вы можете купить в любом
          магазине «ГИППО», «GREEN» или «ВИТАЛЮР» на территории Республики
          Беларусь. Обратите внимание на то, что для успешной регистрации Вам
          понадобится фотография чека. Не спешите его выбрасывать :)
        </p>
      </li>
      <li tabindex="0">
        <span class="Questions__title">
          Какой продукт нужно купить <br />
          для участия в рекламной игре?
        </span>
        <p class="Questions__content Questions__content-long">
          <br />Lion. Готовый завтрак карамельно-шоколадный, обогащ. витамин. и
          минер. Веществ. Готовый сух. завтрак LION. С витам. и минеральными
          веществами <br /><br />Lion Готовый завтрак промо набор
          <br /><br />CINI MINIS. Безбашенные Квадры. Готовый завтрак с корицей,
          обогащенный витаминами и минеральными веществами <br /><br />CINI
          MINIS Безбашенные квадры. Гот. завтрак с корицей, обогащ. вит. и мин.
          вещ. <br /><br />NESTLE GOLD хлопья кукурузн.хруст., обог.вит.и
          мин.веществами <br /><br />NESTLE GOLD. Хлопья кукурузные с медом и
          арахисом, обогащенные витаминами <br /><br />NESTLE GOLD Snow Flakes
          хлопья кукурузн.с сахаром, обог.вит.и мин.веществами
          <br /><br />NESTLE GOFREE. Хлопья кукурузные, обогащенные витаминами.
          <br /><br />NESTLE GOFREE. Хлопья кукурузные шоколадные, обогащенные
          витаминами. <br /><br />NESQUIK. Готов. шоколад. завтрак, обогащ.
          витам. и мин.веществами. <br /><br />NESQUIK готов. шоколад. завтрак,
          обогащ. витам. и мин. веществами, промо набор <br /><br />NESQUIK.
          Готов. шок. завтрак, обогащ. витам. и мин. веществами
          <br /><br />NESQUIK.Шарики и подушечки.Готов.шоколад.завтрак,
          обогащ.витам.и мин. Веществами (ЮнивПарк) <br /><br />NESQUIK.Шарики и
          подушечки.Готов.шоколад.завтрак, обогащ.витам.и мин. веществами
          (миньон) <br /><br />NESQUIK. Готов. шоколад. завтрак, обогащ. витам.
          и мин.веществами. <br /><br />NESQUIK. Готов. шок. завтрак, обогащ.
          вит. и мин. вещ. (Смайлик) <br /><br />NESQUIK. Готов. шок. завтрак,
          обогащ. вит. и мин. вещ. (+ ложка) <br /><br />Nesquik. Готов. Шокол.
          Завтрак, обог. витам и минер. Веществами, промо набор
          <br /><br />NESQUIK готов.шоколад.завтрак, обогащ.витам.и мин.
          веществами <br /><br />NESQUIK готов. шоколад. завтрак, обог. вит. и
          мин. веществами <br /><br />NESQUIK. CHOCOCRUSH. Злаковые подушечки с
          шок. начинкой, обогащ. вит. и минер. вещ. <br /><br />NESQUIK.
          BANANACRUSH. Злаковые подушечки с начинкой со вкусом банана, обогащ.
          вит. и минер. вещ. <br /><br />NESQUIK. Шарики и подушечки. Готов.
          шокол. завтрак, обогащ. вит. и мин. вещ. (Смайлик)
          <br /><br />NESQUIK. Шарики и подушечки. Готов. шокол. завтрак,
          обогащ. вит. и мин. вещ. (+ ложка) <br /><br />NESQUIK.Шарики и
          подушечки.Готов.шоколад.завтрак, обогащ.витам.и мин. веществами
          <br /><br />NESQUIK DUO. Готов. шоколад. завтрак, обогащ. вит. и
          мин.вещ., промо набор <br /><br />NESQUIK DUO. Готов. шоколад.
          завтрак, обогащ. вит. и мин. вещ. <br /><br />NESQUIK DUO
          готов.шоколад.завтрак, обогащ.витам.и мин. Веществами (ЮнивПарк)
          <br /><br />NESQUIK DUO готов.шоколад.завтрак, обогащ.витам.и мин.
          Веществами. (миньон) <br /><br />NESQUIK DUO готов. шоколад. завтрак,
          обогащ. витам. и мин. веществами. <br /><br />NESQUIK DUO. Готов. шок.
          завтрак, обогащ. вит. и мин. вещ. (Смайлик) <br /><br />NESQUIK DUO.
          Готов. шок. завтрак, обогащ. вит. и мин. вещ. (+ ложка)
          <br /><br />NESQUIK DUO. Готов.шоколад.завтрак, обогащ.витам. и мин.
          веществами <br /><br />Nesquik DUO. Готов. шокол. завтрак, обог. витам
          и минер. веществами. <br /><br />NESQUIK Алфавит. Готовый шок.
          Завтрак, обогащ. вит. и минер. веществами. <br /><br />NESQUIK
          Алфавит.готов.шоколад.завтрак <br /><br />KOSMOSTARS. Готов. завтрак
          медовый, обогащ. вит. и мин. вещ. <br /><br />KOSMOSTARS. Готов.
          завтрак медовый, обогащ. вит. и мин. вещ. <br /><br />KOSMOSTARS.
          Готов. завтрак медовый, обогащ. вит. и мин. вещ. (Смайлик)
          <br /><br />KOSMOSTARS. Готов. завтрак медовый, обогащ. вит. и мин.
          вещ. (+ ложка) <br /><br />KOSMOSTARS. Готов. завтрак медовый, обогащ.
          витам. и мин. веществами <br /><br />Готовый завтрак. FITNESS. Хлопья
          из цельной пшеницы, обогащенные витам. и минер. веществами.
          <br /><br />Готовый завтрак. FITNESS&FRUITS. Хлопья из цельн. пшеницы
          с фруктами, ягодами и орехами, обогащ. витам. и мин. Веществами
          <br /><br />Готовый завтрак FITNESS. Хлопья из цельной пшеницы с
          темным шокол., обогащенный витаминами и минеральными веществами
          <br /><br />Готовый завтрак. FITNESS йогуртовый, хлопья из цельной
          пшеницы, покрытые йогуртовой глазурью, обогащенные витаминами и минер.
          вещ. <br /><br />FITNESS. Хлопья из цельн. пшеницы, обогащ. вит. и
          мин. веществами Готовый завтрак FITNESS. Мультизлак. подушечки с
          фруктово-ягодным муссом, обогащенные витаминами и минеральными
          веществами. <br /><br />FITNESS&FRUITS. Хлопья из цельн.пшеницы с
          фруктами, ягодами и орехами, обогащ.витам. и мин.веществами
          <br /><br />ФИТНЕС ЙОГУРТНЫЙ. Хлопья из цельн. пшеницы, покр. йогуртн.
          глаз., обошащ. вит. и минер. вещ. <br /><br />FITNESS. Мультизлак.
          подушечки с фр-яг. муссом, обог. вит. и мин. вещ. <br /><br />FITNESS.
          Хлопья из цельн.пшеницы, обогащ.витам. и мин.веществами
          <br /><br />FITNESS хлопья из цельн. пшеницы, обогащ. вит. и мин.
          веществами <br /><br />Хрутка. Мультизлак. Медовые шарики, обогащ.
          кальцием <br /><br />ХРУТКА. Хруст. мультизлак. подушечки с молочн.
          начинкой, обогащ. кальцием <br /><br />ХРУТКА. Хруст. мультизлак.
          подушечки с шокол. начинкой, обогащ. кальцием <br /><br />Хрутка.
          Мультизлак. Шокол. Колечки, обогащ. Кальцием. <br /><br />ХРУТКА.
          Хлопья медовые хрустящие, обогащ. кальцием. <br /><br />Хрутка. Хлопья
          кукурузные хрустящие, обогащенные кальцием <br /><br />Хрутка. Хлопья
          кукурузные хрустящие, обогащенные кальцием.
        </p>
      </li>
      <li tabindex="0">
        <span class="Questions__title"
          >Что делать, если возникли проблемы с регистрацией?
        </span>
        <p class="Questions__content">
          Если у Вас возникли какие-либо проблемы или трудности с регистрацией,
          обязательно свяжитесь с нами по
          <b>телефону горячей линии +375 (44) 583 76 93</b> или по
          <b>электронной почте: promo@nestle-cereals.by</b>
        </p>
      </li>
      <li tabindex="0">
        <span class="Questions__title">Когда будут проходить розыгрыши? </span>
        <p class="Questions__content" st>
          Дата розыгрыша, в котором Вы участвуете, зависит от того, когда Вы
          прошли регистрацию:
          <br />с 01.03.2021 по 07.03.2021– розыгрыш 09.03.2021 года; <br />с
          01.03.2021 по 14.03.2021 – розыгрыш 16.03.2021 года; <br />с 01.03.2021
          по 21.03.2021 – розыгрыш 23.03.2021 года; <br />с 01.03.2021 по
          28.03.2021 – розыгрыш 30.03.2021 года; <br />с 01.03.2021 по
          04.04.2021 – розыгрыш 06.04.2021 года; <br />с 01.03.2021 по
          11.04.2021 – розыгрыш 13.04.2021 года; <br />с 01.03.2021 по
          18.04.2021 – розыгрыш 20.04.2021 года; <br />с 01.03.2021 по
          25.04.2021 – розыгрыш 27.04.2021 года; <br />с 01.03.2021 по
          30.04.2021 – розыгрыш 04.05.2021 года.

          <br /><br />Если Вы зарегистрировались в период с 01.03.2021 по
          07.03.2021, то будете участвовать во всех розыгрышах рекламной игры!
        </p>
      </li>
      <li tabindex="0">
        <span class="Questions__title">Где и как можно забрать приз? </span>
        <p class="Questions__content">
          Призы можно получить одним из двух способов: <br />
          1)<b> Лично.</b> Для этого до 13 мая 2021 года включительно Вам нужно
          подъехать по адресу: г. Минск, пер. Козлова, 25, пом. 22, с 10.00 по
          18.00 с понедельника по пятницу, с 15.00 по 16.00 по субботам.

          <br /><br />
          Важно! Перед визитом нужно согласовать дату и время Вашего прибытия по
          телефону +375 (44) 583 76 93, с 10.00 по 18.00 с понедельника по
          пятницу, с 15.00 по 16.00 по субботам.
          <br />
          <br />
          При получении приза при себе необходимо иметь оригинал документа,
          удостоверяющего личность.
          <br /><br />2) <b>По почте.</b> Для этого, если Вы победили, нужно
          прислать на почту promo@nestle-cereals.by фотографию документа,
          удостоверяющего личность. Важно: данные должны соответствовать тем,
          которые Вы указывали при регистрации. <br /><br />
          После получения Вашего письма, на адрес, указанный при регистрации,
          Вам будет выслан приз с уведомлением о доставке до 13 мая 2021.
          <br /><br />
          Больше информации Вы можете получить по номеру +375 (44) 583 76 93 с
          10.00 до 18.00 понедельник-пятница, с 12.00 до 13.00 суббота.
        </p>
      </li>
    </ul>
  </div>
</template>

<script>
import Splicer from "./Splicer";

export default {
  name: "Questions",
  components: {
    Splicer,
  },
  data() {
    return {};
  },
  computed: {
    isMobileSize() {
      return this.$vssWidth < this.$desktopSize;
    },
  },
};
</script>

<style lang="less">
@import "../styles/media.less";
@import "../styles/variables.less";

@-moz-document url-prefix() {
  .Questions {
    @media @desktop {
    }
  }
}

.Questions {
  background: @main_color1;
  font-size: 4.8vw;
  padding-bottom: 14vw;
  border-radius: 0 0 0px 30px;
  @media @desktop {
    border-radius: 0 0 0px 169px;
    padding-bottom: 4.5vw;
  }
  .Splicer {
    position: relative;
    bottom: 1.2vw;
    margin-bottom: 6.7vw;
    @media @desktop {
      bottom: 0.5vw;
      margin-bottom: 3vw;
      span {
        margin-left: 28.2vw;
      }
    }
  }
  &__list {
    li {
      outline: none;
      background: #fff;
      text-align: center;
      color: @main_color1;
      font-family: "Lobster";
      width: 94vw;
      margin: auto;
      border-radius: 50px;
      // padding: 3.3vw 0;
      margin-bottom: 3.7vw;
      height: 11vw;
      display: flex;
      align-items: center;
      justify-content: center;
      flex-direction: column;
      cursor: pointer;
      .Questions__title {
        transition: 0s;
      }
      &:hover {
        .Questions__title {
          color: #133e13;
          transition: 0.3s;
        }
      }
      @media @desktop {
        // padding: 1.7vw 0;
        height: 6vw;
        margin-bottom: 2.9vw;
        font-size: 2.5vw;
        width: 88vw;
      }

      &:focus {
        height: auto;
        padding-top: 2vw;

        padding-bottom: 4vw;
        cursor: default;
        .Questions__title {
          color: #133e13;
          font-size: 4.8vw;
          padding-top: 1vw;
        }
        p {
          display: block;
          margin-top: 5.9vw;
          padding-bottom: 1vw;
        }
      }
    }
    p {
      display: none;
      // height: 0;
      overflow: hidden;
      font-family: Roboto;
      padding: 0 7vw;
      font-size: 3.9vw;
      margin-top: 0;
      padding-bottom: 0;
      @media @desktop {
        font-size: 1.5vw;
        text-align: center;
      }
    }
  }

  &__LongList {
    text-align: left;
    font-family: "Roboto";
    & > div {
      border: 1px solid @main_color1;
    }
  }

  &__content {
    &-long {
      text-align: left;
      padding-left: 4vw !important;
    }
  }
}
</style>
