<template>
  <div class="Questions">
    <Splicer value="Вопросы и ответы" />
    <ul class="Questions__list">
      <li tabindex="0">
        <span class="Questions__title"
          >Как принять участие в рекламной игре?
        </span>
        <p class="Questions__content">
          С 1 марта 2021 года по 30 апреля 2021 года включительно нужно: 1)
          Купить 2 продукта, участвующих в рекламной игре, в любом магазине
          «ГИППО», «GREEN», или «ВИТАЛЮР» на территории Республики Беларусь и
          сохранить чек. 2) Зарегистрироваться в рекламной игре на сайте:
          nestle-cereals.by. Для этого нужно заполнить специальную форму и
          загрузить чёткое изображение чека. 3) После того, как Вы выполнили два
          первых пункта, в течение ближайших 24 часов, Вы получите SMS с игровым
          кодом на номер, который указали при регистрации.
        </p>
      </li>
      <li tabindex="0">
        <span class="Questions__title">
          Где можно приобрести продукцию, участвующую в игре?
        </span>
        <p class="Questions__content">
          Продукцию, участвующую в рекламной игре, Вы можете купить в любом
          магазине «ГИППО», «GREEN» или «ВИТАЛЮР» на территории Республики
          Беларусь. Обратите внимание на то, что для успешной регистрации Вам
          понадобится фотография чека. Не спешите его выбрасывать 
        </p>
      </li>
      <li tabindex="0">
        <span class="Questions__title">
          Какой продукт нужно купить для участия в рекламной игре?
        </span>
        <p class="Questions__content">
          Продукты, которые участвуют в рекламной игре: Lion. Готовый завтрак
          карамельно-шоколадный, обогащ. витамин. и минер. Веществ. Готовый сух.
          завтрак LION. С витам. и минеральными веществами Lion Готовый завтрак
          промо набор CINI MINIS. Безбашенные Квадры. Готовый завтрак с корицей,
          обогащенный витаминами и минеральными веществами CINI MINIS
          Безбашенные квадры. Гот. завтрак с корицей, обогащ. вит. и мин. вещ.
          NESTLE GOLD хлопья кукурузн.хруст., обог.вит.и мин.веществами NESTLE
          GOLD. Хлопья кукурузные с медом и арахисом, обогащенные витаминами
          NESTLE GOLD Snow Flakes хлопья кукурузн.с сахаром, обог.вит.и
          мин.веществами NESTLE GOFREE. Хлопья кукурузные, обогащенные
          витаминами. NESTLE GOFREE. Хлопья кукурузные шоколадные, обогащенные
          витаминами. NESQUIK. Готов. шоколад. завтрак, обогащ. витам. и
          мин.веществами. NESQUIK готов. шоколад. завтрак, обогащ. витам. и мин.
          веществами, промо набор NESQUIK. Готов. шок. завтрак, обогащ. витам. и
          мин. веществами NESQUIK.Шарики и подушечки.Готов.шоколад.завтрак,
          обогащ.витам.и мин. Веществами (ЮнивПарк) NESQUIK.Шарики и
          подушечки.Готов.шоколад.завтрак, обогащ.витам.и мин. веществами
          (миньон) NESQUIK. Готов. шоколад. завтрак, обогащ. витам. и
          мин.веществами. NESQUIK. Готов. шок. завтрак, обогащ. вит. и мин. вещ.
          (Смайлик) NESQUIK. Готов. шок. завтрак, обогащ. вит. и мин. вещ. (+
          ложка) Nesquik. Готов. Шокол. Завтрак, обог. витам и минер.
          Веществами, промо набор NESQUIK готов.шоколад.завтрак, обогащ.витам.и
          мин. веществами NESQUIK готов. шоколад. завтрак, обог. вит. и мин.
          веществами NESQUIK. CHOCOCRUSH. Злаковые подушечки с шок. начинкой,
          обогащ. вит. и минер. вещ. NESQUIK. BANANACRUSH. Злаковые подушечки с
          начинкой со вкусом банана, обогащ. вит. и минер. вещ. NESQUIK. Шарики
          и подушечки. Готов. шокол. завтрак, обогащ. вит. и мин. вещ. (Смайлик)
          NESQUIK. Шарики и подушечки. Готов. шокол. завтрак, обогащ. вит. и
          мин. вещ. (+ ложка) NESQUIK.Шарики и подушечки.Готов.шоколад.завтрак,
          обогащ.витам.и мин. веществами NESQUIK DUO. Готов. шоколад. завтрак,
          обогащ. вит. и мин.вещ., промо набор NESQUIK DUO. Готов. шоколад.
          завтрак, обогащ. вит. и мин. вещ. NESQUIK DUO готов.шоколад.завтрак,
          обогащ.витам.и мин. Веществами (ЮнивПарк) NESQUIK DUO
          готов.шоколад.завтрак, обогащ.витам.и мин. Веществами. (миньон)
          NESQUIK DUO готов. шоколад. завтрак, обогащ. витам. и мин. веществами.
          NESQUIK DUO. Готов. шок. завтрак, обогащ. вит. и мин. вещ. (Смайлик)
          NESQUIK DUO. Готов. шок. завтрак, обогащ. вит. и мин. вещ. (+ ложка)
          NESQUIK DUO. Готов.шоколад.завтрак, обогащ.витам. и мин. веществами
          Nesquik DUO. Готов. шокол. завтрак, обог. витам и минер. веществами.
          NESQUIK Алфавит. Готовый шок. Завтрак, обогащ. вит. и минер.
          веществами. NESQUIK Алфавит.готов.шоколад.завтрак KOSMOSTARS. Готов.
          завтрак медовый, обогащ. вит. и мин. вещ. KOSMOSTARS. Готов. завтрак
          медовый, обогащ. вит. и мин. вещ. KOSMOSTARS. Готов. завтрак медовый,
          обогащ. вит. и мин. вещ. (Смайлик) KOSMOSTARS. Готов. завтрак медовый,
          обогащ. вит. и мин. вещ. (+ ложка) KOSMOSTARS. Готов. завтрак медовый,
          обогащ. витам. и мин. веществами Готовый завтрак. FITNESS. Хлопья из
          цельной пшеницы, обогащенные витам. и минер. веществами. Готовый
          завтрак. FITNESS&FRUITS. Хлопья из цельн. пшеницы с фруктами, ягодами
          и орехами, обогащ. витам. и мин. Веществами Готовый завтрак FITNESS.
          Хлопья из цельной пшеницы с темным шокол., обогащенный витаминами и
          минеральными веществами Готовый завтрак. FITNESS йогуртовый, хлопья из
          цельной пшеницы, покрытые йогуртовой глазурью, обогащенные витаминами
          и минер. вещ. FITNESS. Хлопья из цельн. пшеницы, обогащ. вит. и мин.
          веществами Готовый завтрак FITNESS. Мультизлак. подушечки с
          фруктово-ягодным муссом, обогащенные витаминами и минеральными
          веществами. FITNESS&FRUITS. Хлопья из цельн.пшеницы с фруктами,
          ягодами и орехами, обогащ.витам. и мин.веществами ФИТНЕС ЙОГУРТНЫЙ.
          Хлопья из цельн. пшеницы, покр. йогуртн. глаз., обошащ. вит. и минер.
          вещ. FITNESS. Мультизлак. подушечки с фр-яг. муссом, обог. вит. и мин.
          вещ. FITNESS. Хлопья из цельн.пшеницы, обогащ.витам. и мин.веществами
          FITNESS хлопья из цельн. пшеницы, обогащ. вит. и мин. веществами
          Хрутка. Мультизлак. Медовые шарики, обогащ. кальцием ХРУТКА. Хруст.
          мультизлак. подушечки с молочн. начинкой, обогащ. кальцием ХРУТКА.
          Хруст. мультизлак. подушечки с шокол. начинкой, обогащ. кальцием
          Хрутка. Мультизлак. Шокол. Колечки, обогащ. Кальцием. ХРУТКА. Хлопья
          медовые хрустящие, обогащ. кальцием. Хрутка. Хлопья кукурузные
          хрустящие, обогащенные кальцием Хрутка. Хлопья кукурузные хрустящие,
          обогащенные кальцием.
        </p>
      </li>
      <li tabindex="0">
        <span class="Questions__title"
          >Что делать, если возникли проблемы с регистрацией?
        </span>
        <p class="Questions__content">
          Если у Вас возникли какие-либо проблемы или трудности с регистрацией,
          обязательно свяжитесь с нами по телефону горячей линии +375 (44) 583
          76 93 или по электронной почте: promo@nestle-cereals.by
        </p>
      </li>
      <li tabindex="0">
        <span class="Questions__title">Когда будут проходить розыгрыши? </span>
        <p class="Questions__content">
          Дата розыгрыша, в котором Вы участвуете, зависит от того, когда Вы
          прошли регистрацию: с 01.03.2021 по 07.03.2021– розыгрыш 09.03.2021
          года; с 01.03.2021 по 14.03.2021 – розыгрыш 16.03.2021 года с
          01.03.2021 по 21.03.2021 – розыгрыш 23.03.2021 года; с 01.03.2021 по
          28.03.2021 – розыгрыш 30.03.2021 года; с 01.03.2021 по 04.04.2021 –
          розыгрыш 06.04.2021 года; с 01.03.2021 по 11.04.2021 – розыгрыш
          13.04.2021 года; с 01.03.2021 по 18.04.2021 – розыгрыш 20.04.2021
          года; с 01.03.2021 по 25.04.2021 – розыгрыш 27.04.2021 года; с
          01.03.2021 по 30.04.2021 – розыгрыш 04.05.2021 года. Если Вы
          зарегистрировались в период с 01.03.2021 по 07.03.2021, то будете
          участвовать во всех розыгрышах рекламной игры!
        </p>
      </li>
      <li tabindex="0">
        <span class="Questions__title">Где и как можно забрать приз? </span>
        <p class="Questions__content">
          Призы можно получить одним из двух способов: 1) Лично. Для этого до 13
          мая 2021 года включительно Вам нужно подъехать по адресу: г. Минск,
          пер. Козлова, 25, пом. 22, с 10.00 по 18.00 с понедельника по пятницу,
          с 15.00 по 16.00 по субботам. Важно! Перед визитом нужно согласовать
          дату и время Вашего прибытия по телефону +375 (44) 583 76 93, с 10.00
          по 18.00 с понедельника по пятницу, с 15.00 по 16.00 по субботам. При
          получении приза при себе необходимо иметь оригинал документа,
          удостоверяющего личность. 2) По почте. Для этого, если Вы победили,
          нужно прислать на почту promo@nestle-cereals.by фотографию документа,
          удостоверяющего личность. Важно: данные должны соответствовать тем,
          которые Вы указывали при регистрации. После получения Вашего письма,
          на адрес, указанный при регистрации, Вам будет выслан приз с
          уведомлением о доставке до 13 мая 2021. Больше информации Вы можете
          получить по номеру +375 (44) 583 76 93 с 10.00 до 18.00
          понедельник-пятница, с 12.00 до 13.00 суббота.
        </p>
      </li>
    </ul>
  </div>
</template>

<script>
import Splicer from "./Splicer";

export default {
  name: "Questions",
  components: {
    Splicer,
  },
  data() {
    return {};
  },
};
</script>

<style lang="less">
@import "../styles/media.less";
@import "../styles/variables.less";

@-moz-document url-prefix() {
  .Questions {
    @media @desktop {
    }
  }
}

.Questions {
  background: @main_color1;
  font-size: 4.8vw;
  padding-bottom: 14vw;
  border-radius: 0 0 0px 30px;
  @media @desktop {
  }
  .Splicer {
    position: relative;
    bottom: 1.2vw;
    margin-bottom: 8vw;
    @media @desktop {
    }
  }
  &__list {
    li {
      outline: none;
      background: #fff;
      text-align: center;
      color: @main_color1;
      font-family: "Lobster";
      width: 94vw;
      margin: auto;
      border-radius: 50px;
      padding: 3.3vw 0;
      margin-bottom: 3.7vw;
      cursor: pointer;
      .Questions__title{
        transition: 0s;
      }
      &:hover {
        .Questions__title {
          color: #133e13;
          transition: .3s;
        }
      }
      @media @desktop {
      }

      &:focus {
        cursor: default;
        .Questions__title {
          color: #133e13;
          font-size: 6.8vw;
        }
        p {
          height: auto;
          margin-top: 5.9vw;
          padding-bottom: 1vw;
        }
      }
    }
    p {
      height: 0;
      overflow: hidden;
      font-family: Roboto;
      padding: 0 7vw;
      font-size: 3.9vw;
      margin-top: 0;
      padding-bottom: 0;
      @media @desktop {
      }
    }
  }
}
</style>
